---
kind: property
id: P:Autodesk.Revit.DB.DimensionSegment.ValueOverride
source: html/eba172e3-24cb-443e-e5f5-9fd0bcf137cd.htm
---
# Autodesk.Revit.DB.DimensionSegment.ValueOverride Property

The text that replaces the segment's value.

## Syntax (C#)
```csharp
public string ValueOverride { get; set; }
```